using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

public enum AppModules
{
    未知 = 0,
    用户登陆 = -100,
    导航 = -101,
    个人资料 = -102,
    帮助中心 = -103,
    售后服务 = -104,
    我的文件 = -105,
    个人设置 = -106,
    系统设置 = -107,
    上传下载文件 = -108,
    工作计划 = -109,
    我的消息 = -110,
    角色管理 = -111,
    权限管理 = -112,
    帐户管理 = -113,
    执行SQL = -114,
    找回密码 = -115,
    内部反馈 = -116,
    初始模块 = -117,
    系统流程 = -118,
    快捷操作 = -119,
    加密解密 = -120,
    快速建表 = -121,
    插件管理 = -122
}
